# Список русских букв (кириллица)
# from constants import RUSSIAN_LETTERS
RUSSIAN_LETTERS = "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"

# Список форматов дат
# from constants import DATE_FORMATS
DATE_FORMATS = [
    # ГГГГ-ММ-ДД (ISO 8601 с микросекундами)
    "%Y-%m-%dT%H:%M:%S.%f",  # 1988-01-05T08:30:03.032008
    # ГГГГ-ММ-ДД (ISO 8601 с временем)
    "%Y-%m-%dT%H:%M:%S",  # 1988-01-05T08:30:00
    # время по Гринвичу (UTC +0)
    "%Y-%m-%dT%H:%M:%S.%fZ",  # 1988-01-05T08:30:03.032008Z
    "%Y-%m-%dT%H:%M:%SZ",  # 1988-01-05T08:30:00Z
    # ГГГГ-ММ-ДД (ISO 8601)
    "%Y-%m-%d",  # 1988-01-05
    # ГГ-ММ-ДД (ISO 8601, короткий год)
    "%y-%m-%d",  # 88-01-05
    # ГГГГММДД (Компактный ISO)
    "%Y%m%d",  # 19880105
    # ДД.ММ.ГГГГ (Европейский стиль)
    "%d.%m.%Y",  # 05.01.1988
    # Д.М.ГГГГ (Европейский стиль, без нулей)
    "%-d.%-m.%Y",  # 5.1.1988
    # Д/М/ГГГГ (Европейский стиль, слэш, без нулей)
    "%-d/%-m/%Y",  # 5/1/1988
    # ММ/ДД/ГГГГ (Американский стиль)
    "%m/%d/%Y",  # 01/05/1988
    # ММ/ДД/ГГ (Американский стиль, короткий год)
    "%m/%d/%y",  # 01/05/88
    # ДД/ММ/ГГГГ (Британский / Европейский стиль)
    "%d/%m/%Y",  # 05/01/1988
    # ДД/ММ/ГГ (Британский / Европейский стиль, короткий год)
    "%d/%m/%y",  # 05/01/88
    # Форматы для Excel
    "%Y-%m-%d %H:%M:%S",  # 2008-03-03 17:20:00 (без буквы T)
    "%d.%m.%Y %H:%M:%S",  # 03.03.2008 17:20:00 (европейский стиль с временем)
    "%d.%m.%Y %H:%M",  # 03.03.2008 17:20 (без секунд)
    "%d.%m.%Y %H:%M:%S.%f",  # 03.03.2008 17:20:12.345678 (с микросекундами)
]
